---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WorksharingFailures.DuplicateNamesChanged
source: html/054b172d-4e2d-6b49-480c-e0dc12552383.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WorksharingFailures.DuplicateNamesChanged Property

These elements' names were automatically changed to eliminate duplicates.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateNamesChanged { get; }
```